{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_layer", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 1, 4], "dtype": "float32", "sparse": false, "name": "input_layer"}, "inbound_nodes": []}, {"name": "reshape_layer", "class_name": "Reshape", "config": {"name": "reshape_layer", "trainable": true, "dtype": "float32", "target_shape": [4]}, "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"name": "repeater", "class_name": "RepeatVector", "config": {"name": "repeater", "trainable": true, "dtype": "float32", "n": 1}, "inbound_nodes": [[["reshape_layer", 0, 0, {}]]]}, {"name": "LSTM_layer", "class_name": "LSTM", "config": {"name": "LSTM_layer", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 5, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": {"class_name": "L1L2", "config": {"l1": 0.009999999776482582, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["repeater", 0, 0, {}]]]}, {"name": "output_layer", "class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LSTM_layer", 0, 0, {}]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}